_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СвязиМеждуРаботами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СвязиМеждуРаботами</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЗависимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ТипыЗависимостейРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаЗадержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительстваПредшественника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаПредшественник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаПоследователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СвязиМеждуРаботами/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.ОбъектСтроительстваПредшественника) И 
		ЗначениеЗаполнено(Параметры.ОбъектСтроительстваПредшественника) Тогда 
		Запись.ОбъектСтроительстваПредшественника = Параметры.ОбъектСтроительстваПредшественника;	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Запись.РаботаПоследователь) И 
		ЗначениеЗаполнено(Параметры.РаботаПоследователь) Тогда 
		Запись.РаботаПоследователь = Параметры.РаботаПоследователь;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда 
		Организация = Параметры.Организация;	
	Иначе
		Организация = Запись.РаботаПоследователь.Владелец.Организация;
	КонецЕсли;
	
	СценарийПланированияПредшественника	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Запись.ОбъектСтроительстваПредшественника, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПредшественникаПриИзменении(Элемент)
	
	СценарийПланированияПредшественника	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Запись.ОбъектСтроительстваПредшественника, Организация);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("СценарийПланирования",  СценарийПланированияПредшественника);
	ПараметрОповещения.Вставить("Работа",                Запись.РаботаПоследователь);
	ПараметрОповещения.Вставить("Родитель",              ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Запись.РаботаПоследователь, "Родитель"));
	
	МассивИзмененныхРабот	= Новый Массив;
	МассивИзмененныхРабот.Добавить(Запись.РаботаПоследователь);	
	ПараметрОповещения.Вставить("МассивИзмененныхРабот", МассивИзмененныхРабот);
	
	Оповестить("ИзмененаРабота", ПараметрОповещения, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаПредшественникАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = УСОERP_УправлениеСтроительнымПроизводством.СформироватьДанныеВыбораРаботыСценарияПланирования(Текст, СценарийПланированияПредшественника, Запись.РаботаПоследователь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаботаПредшественникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = УСОERP_УправлениеСтроительнымПроизводством.СформироватьДанныеВыбораРаботыСценарияПланирования(Текст, СценарийПланированияПредшественника, Запись.РаботаПоследователь);
	КонецЕсли;

КонецПроцедуры
